In [1]:
import pandas as pd
print(pd.__version__)

2.2.2

In [2]:
data={'name':['alice','bob','mani'],
     'age':[25,30,28],
     'city':['bangalore','chennai','london']}
df=pd.DataFrame(data)
print(df)

#  to get info for dataframe

df.info()

    name  age       city
0  alice   25  bangalore
1    bob   30    chennai
2   mani   28     london
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [ ]:
# to fetch records top
df.head()
# to fetch records bottom
df.tail()
# to fetch records randomly
df.sample()

In [8]:
import pandas as pd
 #creating Dataframe
 #creating Dictionary
data1={'stdid':['stdid01','stdid02','stdid03','stdid04','stdid05','stdid06','stdid07','stdid08','stdid09','stdid10'],
 'Stdnt Name':['Koguru Varshitha','ANUSHA C','Navya.S','S Preethi Verdhini ','padma','priya','chithra','anu','indhu','madhu'],
 'Hindi':[56,65,76,87,92,66,77,95,100,82],
 'English':[58,69,70,82,94,62,79,91,88,82]
 }
 #Creating pandas dataframe
df=pd.DataFrame(data1)
print(df)

     stdid           Stdnt Name  Hindi  English
0  stdid01     Koguru Varshitha     56       58
1  stdid02             ANUSHA C     65       69
2  stdid03              Navya.S     76       70
3  stdid04  S Preethi Verdhini      87       82
4  stdid05                padma     92       94
5  stdid06                priya     66       62
6  stdid07              chithra     77       79
7  stdid08                  anu     95       91
8  stdid09                indhu    100       88
9  stdid10                madhu     82       82

In [9]:
#to get information of df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   stdid       10 non-null     object
 1   Stdnt Name  10 non-null     object
 2   Hindi       10 non-null     int64
 3   English     10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [10]:
#to fetch 6 records
df.head()

     stdid           Stdnt Name  Hindi  English
0  stdid01     Koguru Varshitha     56       58
1  stdid02             ANUSHA C     65       69
2  stdid03              Navya.S     76       70
3  stdid04  S Preethi Verdhini      87       82
4  stdid05                padma     92       94

In [11]:
#to fetch 6 records from bottom
df.tail()

     stdid Stdnt Name  Hindi  English
5  stdid06      priya     66       62
6  stdid07    chithra     77       79
7  stdid08        anu     95       91
8  stdid09      indhu    100       88
9  stdid10      madhu     82       82

In [12]:
#to fetch random data
df.sample(4)

     stdid           Stdnt Name  Hindi  English
6  stdid07              chithra     77       79
3  stdid04  S Preethi Verdhini      87       82
8  stdid09                indhu    100       88
0  stdid01     Koguru Varshitha     56       58

In [13]:
#to display shape of the df
print("shape of the Dataframe")
print("No of Rows:",df.shape[0])
print("No of Columns:",df.shape[1])

shape of the Dataframe
No of Rows: 10
No of Columns: 4

In [14]:
df.loc[len(df)]=['stdid11','Priya',58,89]
print(df)

      stdid           Stdnt Name  Hindi  English
0   stdid01     Koguru Varshitha     56       58
1   stdid02             ANUSHA C     65       69
2   stdid03              Navya.S     76       70
3   stdid04  S Preethi Verdhini      87       82
4   stdid05                padma     92       94
5   stdid06                priya     66       62
6   stdid07              chithra     77       79
7   stdid08                  anu     95       91
8   stdid09                indhu    100       88
9   stdid10                madhu     82       82
10  stdid11                Priya     58       89

In [15]:
#to delete a row
df=df.drop(df.index[10])
print(df)

     stdid           Stdnt Name  Hindi  English
0  stdid01     Koguru Varshitha     56       58
1  stdid02             ANUSHA C     65       69
2  stdid03              Navya.S     76       70
3  stdid04  S Preethi Verdhini      87       82
4  stdid05                padma     92       94
5  stdid06                priya     66       62
6  stdid07              chithra     77       79
7  stdid08                  anu     95       91
8  stdid09                indhu    100       88
9  stdid10                madhu     82       82

In [16]:
#to delete coloumn
Hindi_column=df.pop('Hindi')
print(df)

     stdid           Stdnt Name  English
0  stdid01     Koguru Varshitha       58
1  stdid02             ANUSHA C       69
2  stdid03              Navya.S       70
3  stdid04  S Preethi Verdhini        82
4  stdid05                padma       94
5  stdid06                priya       62
6  stdid07              chithra       79
7  stdid08                  anu       91
8  stdid09                indhu       88
9  stdid10                madhu       82

In [17]:
import pandas as pd
 #step1:Creating dataframe
data={
 'Product':['Shirt','Pants','Frock','Socks','Headset','Shoes'],
 'Region':['East','West','East','South','East','North'],
 'Sales':[100,200,140,300,260,180]
}
df=pd.DataFrame(data)
print(df)

   Product Region  Sales
0    Shirt   East    100
1    Pants   West    200
2    Frock   East    140
3    Socks  South    300
4  Headset   East    260
5    Shoes  North    180

In [18]:
#filter the data---sales>150
High_sales=df[df['Sales']>150]
print("\n Filtered(Sales>150):")
print(High_sales)

 Filtered(Sales>150):
   Product Region  Sales
1    Pants   West    200
3    Socks  South    300
4  Headset   East    260
5    Shoes  North    180

In [19]:
#Group by product and calculating totalsales
Grouped_sales=df.groupby('Product')['Sales'].sum().reset_index()
print("\n Total sales by product:")
print(Grouped_sales)

 Total sales by product:
   Product  Sales
0    Frock    140
1  Headset    260
2    Pants    200
3    Shirt    100
4    Shoes    180
5    Socks    300

In [22]:
#sorting in Descending in order
Sorted_df=df.sort_values(by='Sales',ascending=False)
print("\n Sorted  by Sales(Descending):")
print(Sorted_df)

 Sorted  by Sales(Descending):
   Product Region  Sales
3    Socks  South    300
4  Headset   East    260
1    Pants   West    200
5    Shoes  North    180
2    Frock   East    140
0    Shirt   East    100

In [23]:
df.describe()

            Sales
count    6.000000
mean   196.666667
std     74.206918
min    100.000000
25%    150.000000
50%    190.000000
75%    245.000000
max    300.000000